[
  {
    "id": 1,
    "title": "Mero Byapar",
    "featuredImage": "/projects/card/mero-byapar.png",
    "url": "https://mero-byapar.vercel.app",
    "github": "https://github.com/suzan-rana/mero-byapar",
    "stack": [
      "Web Application",
      "Next JS",
      "Prisma",
      "React",
      "Node.js",
      "React Query",
      "Tailwind CSS",
      "Zod",
      "TypeScript"
    ],
    "subtitle": "Mero byapar is a inventory management system that helps business owners take care of their products, manage stocks, prepare orders and keep record of items to buy if they need to",
    "description": "Hello, world"
  },
  {
    "id": 2,
    "title": "Vibe",
    "featuredImage": "/projects/card/vibe.png",
    "url": "https://v-suzan-rana.vercel.app/",
    "stack": [
      "Web Application",
      "Next JS",
      "Prisma",
      "tRPC",
      "React",
      "Node.js",
      "React Query",
      "Tailwind CSS",
      "Zod",
      "TypeScript"
    ],
    "github": "https://github.com/suzan-rana/Write-Your-Vibes",
    "subtitle": "Vibe is a blog management system that helps business owners take care of their products, manage stocks, prepare orders and keep record of items to buy if they need to"
  },
  {
    "id": 3,
    "title": "Task Manager",
    "featuredImage": "/projects/card/task-manager.png",
    "url": "https://task-manager-4zbi.vercel.app/",
    "stack": [
      "React Beautiful DND",
      "Drag and Drop",
      "Web Application",
      "React",
      "Node.js",
      "React Query",
      "Tailwind CSS",
      "Zod",
      "TypeScript"
    ],
    "github": "https://github.com/suzan-rana/task-manager",
    "subtitle": "Task Manager is a task management system that helps business owners take care of their products, manage stocks, prepare orders and keep record of items to buy if they need to",
    "description": "<p>Task Manager is a dynamic project management application developed using React Beautiful DND, a powerful library that enables seamless drag and drop functionality. Drawing inspiration from the popular Jira platform, the application provides users with a visually appealing and intuitive interface for managing tasks. With three primary states—To-Do, In Progress, and Done—the Task Manager offers a flexible and efficient way to organize and track tasks throughout the project lifecycle.</p><p>One of the key features of Task Manager is its drag and drop functionality, which empowers users to easily reorganize and update their task lists. Leveraging React Beautiful DND, users can effortlessly move tasks between different states by simply dragging and dropping them into the desired category. This intuitive interaction allows for seamless task management and enhances productivity by streamlining the process of updating task statuses.</p>"
  }
]
